package by.TMS_Dudak.Lesson12Coll;

public class Lecture {
    //мы выледяем обхий тип который мы долдны будем опр на этапе создания объекта
    //в <> мы задаем название типа, за частую это обычные буквы
    //заменяем тип переменной на то что тут <>
    //компилятор берет то значение дженерика и вставляет
    //дженерик может быть на кровне класса или на уровне метода
    //на вход принимает джинерик и возращает дженерик
    //дженерики инварианты, ковариантны, контравариантность
    //<? extends Number> - wildcard
    //List - наследуется от коллекшон
    //две основнеы имплементации Linked - двусязных список (вставка в начало или конец (тоже самое касается и удаления)
    //add - добавление в колекцию. Если мы пишем с индексом (1, "Danik") это всавка на индекс вперед
    //set - перезапись
    //remove -
    // Array - )
    //
}
